In [1]:
import pandas as pd

In [2]:
d = {"time_point" : ['t1','t2','t3','t4','t5'] , "all_electronics" : [6,5,4,3,2] , "high_tech" : [20,10,14,5,5] }

In [3]:
df=pd.DataFrame(d)

In [4]:
df

  time_point  all_electronics  high_tech
0         t1                6         20
1         t2                5         10
2         t3                4         14
3         t4                3          5
4         t5                2          5

In [5]:
df['all_electronics'].mean()

4.0

In [6]:
df['high_tech'].mean()

10.8

In [7]:
mul  = (df['all_electronics'].mean())*(df['high_tech'].mean())

In [8]:
mul

43.2

In [9]:
df['mul2'] = (df['all_electronics'])*(df['high_tech'])

In [10]:
df

  time_point  all_electronics  high_tech  mul2
0         t1                6         20   120
1         t2                5         10    50
2         t3                4         14    56
3         t4                3          5    15
4         t5                2          5    10

In [19]:
x = (df['mul2'].sum())/df['mul2'].count()

In [20]:
x

50.2

In [21]:
cov = x - mul

In [22]:
cov

7.0

In [25]:
df.describe()

       all_electronics  high_tech        mul2
count         5.000000   5.000000    5.000000
mean          4.000000  10.800000   50.200000
std           1.581139   6.379655   44.047701
min           2.000000   5.000000   10.000000
25%           3.000000   5.000000   15.000000
50%           4.000000  10.000000   50.000000
75%           5.000000  14.000000   56.000000
max           6.000000  20.000000  120.000000